{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_1\n",
    "\n",
    "# Список чисел\n",
    "\n",
    "# На вход программе подается одно число n. \n",
    "# Напишите программу, которая выводит список [1, 2, 3, ..., n].\n",
    "# \n",
    "# Формат входных данных\n",
    "# На вход программе подается одно натуральное число.\n",
    "# \n",
    "# Формат выходных данных\n",
    "# Программа должна вывести текст в соответствии с условием задачи.\n",
    "\n",
    "n = int(input())\n",
    "\n",
    "nlist = list(range(1, n + 1))\n",
    "print(nlist)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_2\n",
    "\n",
    "# Список букв\n",
    "# \n",
    "# На вход программе подается одно число n. \n",
    "# Напишите программу, которая выводит список, состоящий из \n",
    "# n букв английского алфавита ['a', 'b', 'c', ...] в нижнем регистре\n",
    "# \n",
    "# Формат входных данных\n",
    "# На вход программе подается натуральное число n,n≤26.\n",
    "# \n",
    "# Формат выходных данных\n",
    "# Программа должна вывести текст в соответствии с условием задачи.\n",
    "\n",
    "n = int(input())\n",
    "\n",
    "l = list(chr(x) for x in range(97, n + 97))\n",
    "print(l)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_3\n",
    "\n",
    "# Список строк\n",
    "\n",
    "# На вход программе подается натуральное число n, а затем n строк. Напишите программу, которая создает из указанных строк список и выводит его.\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подаются натуральное число n, а затем n строк, каждая на отдельной строке.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести список состоящий из указанных строк.\n",
    "\n",
    "n = int(input())\n",
    "ls = []\n",
    "\n",
    "for i in range(0, n):\n",
    "    a = input()\n",
    "    ls.append(a)\n",
    "print(ls)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_4\n",
    "\n",
    "# Алфавит\n",
    "\n",
    "# Напишите программу, выводящую следующий список: ['a', 'bb', 'ccc', 'dddd', 'eeeee', 'ffffff', ...]\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести указанный список.\n",
    "\n",
    "# Примечание. Последний элемент списка состоит из 26 символов z.\n",
    "\n",
    "ls = []\n",
    "for i in range(1, 27):\n",
    "    ls.append(i * chr(i + 96))\n",
    "print(ls)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_4\n",
    "\n",
    "# Список кубов\n",
    "\n",
    "# На вход программе подается натуральное число n, а затем n целых чисел. Напишите программу, которая создает из указанных чисел список их кубов.\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подаются натуральное число n, а затем n целых чисел, каждое на отдельной строке.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести список, состоящий из кубов указанных чисел.\n",
    "\n",
    "n = int(input())\n",
    "ls = []\n",
    "x = 0\n",
    "\n",
    "for i in range(0, n):\n",
    "    a = int(input())\n",
    "    x = a * a * a\n",
    "    ls.append(x)\n",
    "print(ls)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_5\n",
    "\n",
    "# Список делителей\n",
    "\n",
    "# На вход программе подается натуральное число n. Напишите программу, которая создает список состоящий из делителей введенного числа.\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подается натуральное число n.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести список, состоящий из делителей введенного числа.\n",
    "\n",
    "n = int(input())\n",
    "ls = []\n",
    "\n",
    "for i in range(1, n + 1):\n",
    "    if n % i == 0:\n",
    "        ls.append(i)\n",
    "print(ls)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_6\n",
    "\n",
    "# Суммы двух\n",
    "\n",
    "# На вход программе подается натуральное число n≥2, а затем n целых чисел.\n",
    "# Напишите программу, которая создает из указанных чисел список, состоящий\n",
    "# из сумм соседних чисел (0 и 1, 1 и 2, 2 и 3 и т.д.).\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подаются натуральное число n, а затем n целых чисел, \n",
    "# каждое на отдельной строке.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести список, состоящий из сумм соседних чисел.\n",
    "\n",
    "n = int(input())\n",
    "ls = []\n",
    "ls_new = []\n",
    "\n",
    "for i in range(0, n):\n",
    "    a = int(input())\n",
    "    ls.append(a)\n",
    "\n",
    "for j in range(1, n):\n",
    "    a_new = ls[j - 1] + ls[j]\n",
    "    ls_new.append(a_new)\n",
    "print(ls_new)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "ddac41972b0c940883be4cef39408fe7bdd4a6baf6c20cac086328bb00100dca"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
