{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8 8 8 \n",
      "8 8 8 \n",
      "8 8 8 \n",
      "8 8 8 \n",
      "8 8 8 \n",
      "8 8 8 \n",
      "8 8 8 \n",
      "8 8 8 \n"
     ]
    }
   ],
   "source": [
    "# Задача_1\n",
    "\n",
    "# Дано натуральное число n (n≤ 9). Напишите программу, которая печатает таблицу размером n×3 состоящую из данного числа (числа отделены одним пробелом).\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подается одно натуральное число.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести таблицу размером n×3 состоящую из данного числа.\n",
    "\n",
    "# Примечание. В конце строки может быть пробел.\n",
    "\n",
    "n = int(input())\n",
    "for i in range(n):\n",
    "    for j in range(3):\n",
    "        print(n, end=\" \")\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 1 1 1 1 \n",
      "2 2 2 2 2 \n",
      "3 3 3 3 3 \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Задача_2\n",
    "# Дано натуральное число n (n≤ 9). Напишите программу, которая печатает таблицу размером n×5, где в i-ой строке указано число i (числа отделены одним пробелом).\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подается одно натуральное число.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести таблицу размером n×5 в соответствии с условием.\n",
    "\n",
    "# Примечание. В конце строки может быть пробел.\n",
    "\n",
    "n = int(input())\n",
    "for i in range(1, n+1):\n",
    "    for j in range(1, 6):\n",
    "        print(i, end=\" \")\n",
    "    print()\n",
    "print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 + 1 = 2\n",
      "1 + 2 = 3\n",
      "1 + 3 = 4\n",
      "1 + 4 = 5\n",
      "1 + 5 = 6\n",
      "1 + 6 = 7\n",
      "1 + 7 = 8\n",
      "1 + 8 = 9\n",
      "1 + 9 = 10\n",
      "\n",
      "2 + 1 = 3\n",
      "2 + 2 = 4\n",
      "2 + 3 = 5\n",
      "2 + 4 = 6\n",
      "2 + 5 = 7\n",
      "2 + 6 = 8\n",
      "2 + 7 = 9\n",
      "2 + 8 = 10\n",
      "2 + 9 = 11\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Задача_3\n",
    "\n",
    "# Дано натуральное число n (n≤ 9). Напишите программу, которая печатает таблицу сложения для всех чисел от 1 до n в соответствии с примером.\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подается одно натуральное число.\n",
    " \n",
    "# Формат выходных данных\n",
    "# Программа должна вывести таблицу сложения для всех чисел от 1 до n.\n",
    "\n",
    "# Примечание. В конце строки может быть пробел.\n",
    "\n",
    "n = int(input())\n",
    "for i in range(1, n+1):\n",
    "    for j in range(1, 10):\n",
    "        print(i, \"+\", j, \"=\", i+j)\n",
    "    print()\n",
    "print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "*\n",
      "**\n",
      "***\n",
      "****\n",
      "*****\n",
      "****\n",
      "***\n",
      "**\n",
      "*\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Задача_4\n",
    "\n",
    "# Дано нечетное натуральное число n. Напишите программу, которая печатает равнобедренный звездный треугольник с основанием, равным n в соответствии с примером:\n",
    "\n",
    "# *\n",
    "# **\n",
    "# ***\n",
    "# ****\n",
    "# ***\n",
    "# **\n",
    "# *\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подается одно нечетное натуральное число.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести треугольник в соответствии с условием.\n",
    "\n",
    "# Примечание. Используйте вложенный цикл for.\n",
    "\n",
    "n = int(input())\n",
    "\n",
    "for i in range(1, n//2+2):\n",
    "    for j in range(1, i+1):\n",
    "        print(\"*\", end=\"\")\n",
    "    print()\n",
    "\n",
    "for b in range(n//2, 0, -1):\n",
    "    print(\"*\"*b)\n",
    "print()\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "ddac41972b0c940883be4cef39408fe7bdd4a6baf6c20cac086328bb00100dca"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
