{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_1\n",
    " \n",
    "# В столбик 1\n",
    "# На вход программе подается одна строка. Напишите программу, которая выводит элементы строки с индексами 0, 2, 4, ... в столбик.\n",
    " \n",
    "# Формат входных данных\n",
    "# На вход программе подается одна строка.\n",
    " \n",
    "# Формат выходных данных\n",
    "# Программа должна вывести элементы строки с индексами 0, 2, 4, ..., каждое на отдельной строке.\n",
    "\n",
    "s = input()\n",
    "\n",
    "for i in range(0, len(s), 2):\n",
    "    print(s[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_2\n",
    "\n",
    "# В столбик 2\n",
    "# На вход программе подается одна строка. Напишите программу, которая выводит в столбик элементы строки в обратном порядке.\n",
    "# \n",
    "# Формат входных данных\n",
    "# На вход программе подается одна строка.\n",
    "# \n",
    "# Формат выходных данных\n",
    "# Программа должна вывести в столбик элементы строки в обратном порядке. \n",
    "\n",
    "s = input()\n",
    "\n",
    "for i in range(-1, -len(s)-1, -1):\n",
    "    print(s[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_3\n",
    "\n",
    "# ФИО\n",
    "\n",
    "# На вход программе подаются три строки: имя, фамилия и отчество. Напишите программу, которая выводит инициалы человека.\n",
    " \n",
    "# Формат входных данных\n",
    "# На вход программе подаются три строки, каждая на отдельной строке.\n",
    " \n",
    "# Формат выходных данных\n",
    "# Программа должна вывести ФИО человека.\n",
    " \n",
    "# Примечание. Гарантируется, что имя, фамилия и отчество начинаются с заглавной буквы.\n",
    "\n",
    "f_name = input()\n",
    "s_name = input()\n",
    "patronymic = input()\n",
    "\n",
    "print(s_name[0])\n",
    "print(f_name[0])\n",
    "print(patronymic[0])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_4\n",
    "\n",
    "# Цифра 1\n",
    "# \n",
    "# На вход программе подается одна строка состоящая из цифр. Напишите программу, которая считает сумму цифр данной строки.\n",
    "# \n",
    "# Формат входных данных\n",
    "# На вход программе подается одна строка состоящая из цифр.\n",
    "# \n",
    "# Формат выходных данных\n",
    "# Программа должна вывести сумму цифр данной строки.\n",
    "\n",
    "s = input()\n",
    "sum = 0\n",
    "\n",
    "for i in range(0, len(s)):\n",
    "    sum += int(s[i])\n",
    "print(sum)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_5\n",
    "\n",
    "# Цифра 2\n",
    "\n",
    "# На вход программе подается одна строка. Напишите программу, которая выводит сообщение «Цифра» (без кавычек), \n",
    "# если строка содержит цифру. В противном случае вывести сообщение «Цифр нет» (без кавычек).\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подается одна строка.\n",
    " \n",
    "# Формат выходных данных\n",
    "# Программа должна вывести текст в соответствии с условием задачи.\n",
    "\n",
    "s = input()\n",
    "count = 0\n",
    "\n",
    "for i in range(0, len(s)):\n",
    "    if  s[i] in \"0123456789\":\n",
    "        count += 1\n",
    "if count != 0:\n",
    "    print(\"Цифра\")\n",
    "else:\n",
    "    print(\"Цифр нет\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_6\n",
    "\n",
    "# Сколько раз?\n",
    "# \n",
    "# На вход программе подается одна строка. Напишите программу, которая определяет сколько раз в строке встречаются символы + и *.\n",
    "# \n",
    "# Формат входных данных\n",
    "# На вход программе подается одна строка.\n",
    "# \n",
    "# Формат выходных данных\n",
    "# Программа должна вывести сколько раз встречаются символы  + и * в строке.\n",
    "\n",
    "s = input()\n",
    "count1 = 0\n",
    "count2 = 0\n",
    "\n",
    "for i in range(0, len(s)):\n",
    "    if s[i] in \"+\":\n",
    "        count1 += 1\n",
    "    if s[i] in \"*\":\n",
    "        count2 += 1\n",
    "print(\"Символ + встречается\", count1, \"раз\")\n",
    "print(\"Символ * встречается\", count2, \"раз\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_7\n",
    "\n",
    "# Одинаковые соседи\n",
    "# \n",
    "# На вход программе подается одна строка. Напишите программу, которая определяет сколько в ней одинаковых соседних символов.\n",
    "# \n",
    "# Формат входных данных\n",
    "# На вход программе подается одна строка.\n",
    "# \n",
    "# Формат выходных данных\n",
    "# Программа должна вывести количество одинаковых соседних символов.\n",
    "\n",
    "s = input()\n",
    "count = 0\n",
    "\n",
    "for i in range(0, len(s) - 1):\n",
    "    if s[i] == s[i + 1]:\n",
    "        count += 1\n",
    "print(count)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_8\n",
    "\n",
    "# Гласные и согласные\n",
    "# На вход программе подается одна строка с буквами русского языка. \n",
    "# Напишите программу, которая определяет количество гласных и согласных букв.\n",
    "# \n",
    "# Формат входных данных\n",
    "# На вход программе подается одна строка.\n",
    "# \n",
    "# Формат выходных данных\n",
    "# Программа должна вывести количество гласных и согласных букв.\n",
    "# \n",
    "# Примечание. В русском языке 10 гласных букв (а, у, о, ы, и, э, я, ю, ё, е) и \n",
    "# 21 согласная буква (б, в, г, д, ж, з, й, к, л, м, н, п, р, с, т, ф, х, ц, ч, ш, щ).\n",
    "\n",
    "s = input()\n",
    "count1 = 0                  # счетчик гласных\n",
    "count2 = 0                  # счетчик согласных\n",
    "\n",
    "for i in range(0, len(s)):\n",
    "    if s[i] in \"ауоыиэяюёеАУОЫИЭЯЮЁЕ\":\n",
    "        count1 += 1\n",
    "    if s[i] in \"бвгджзйклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ\":\n",
    "        count2 += 1\n",
    "\n",
    "print(\"Количество гласных букв равно\", count1)\n",
    "print(\"Количество согласных букв равно\", count2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_9\n",
    "\n",
    "# Decimal to Binary\n",
    "# \n",
    "# На вход программе подается натуральное число, записанное в десятичной системе счисления. \n",
    "# Напишите программу, которая переводит данное число в двоичную систему счисления.\n",
    "# \n",
    "# Формат входных данных\n",
    "# На вход программе подается одно натуральное число.\n",
    "# \n",
    "# Формат выходных данных\n",
    "# Программа должна вывести число записанное в двоичной системе счисления.\n",
    "\n",
    "n = int(input())\n",
    "b = ''\n",
    " \n",
    "while n > 0:\n",
    "    b = str(n % 2) + b\n",
    "    n = n // 2\n",
    " \n",
    "print(b)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "ddac41972b0c940883be4cef39408fe7bdd4a6baf6c20cac086328bb00100dca"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
