{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Задача_1\n",
    "\n",
    "#На вход программе подается последовательность слов, каждое слово на отдельной строке. \n",
    "#Концом последовательности является слово «КОНЕЦ» (без кавычек). \n",
    "#Напишите программу, которая выводит члены данной последовательности.\n",
    "\n",
    "#Формат входных данных\n",
    "#На вход программе подается последовательность слов, каждое слово на отдельной строке.\n",
    "\n",
    "#Формат выходных данных\n",
    "#Программа должна вывести члены данной последовательности.\n",
    "\n",
    "text = input()      # считываем первое слово последовательности\n",
    "while text != \"КОНЕЦ\":\n",
    "    print(text)\n",
    "    text = input()\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_2\n",
    "\n",
    "# На вход программе подается последовательность слов, каждое слово на отдельной строке. \n",
    "# Концом последовательности является слово «КОНЕЦ» или «конец» (большими или маленькими буквами, без кавычек).\n",
    "# Напишите программу, которая выводит члены данной последовательности.\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подается последовательность слов, каждое слово на отдельной строке.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести члены данной последовательности.\n",
    "\n",
    "text = input()      # считываем первое слово последовательности\n",
    "while \"КОНЕЦ\" != text != \"конец\": # text != \"конец\" and text != \"КОНЕЦ\"\n",
    "    print(text)\n",
    "    text = input()\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4\n"
     ]
    }
   ],
   "source": [
    "# Задача_3\n",
    "# На вход программе подается последовательность слов, каждое слово на отдельной строке. \n",
    "# Концом последовательности является одно из трех слов: «стоп», «хватит», «достаточно» (маленькими буквами, без кавычек). \n",
    "# Напишите программу, которая выводит общее количество членов данной последовательности.\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подается последовательность слов, каждое слово на отдельной строке.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести общее количество членов данной последовательности.\n",
    "\n",
    "text = input()      # считываем первое слово последовательности\n",
    "i = 0               # счетчик количества членов последовательности\n",
    "while text != \"стоп\" and text != \"хватит\" and text != \"достаточно\":\n",
    "    text = input()\n",
    "    i += 1\n",
    "print(i)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_4\n",
    "\n",
    "# На вход программе подается последовательность целых чисел делящихся на 7, каждое число на отдельной строке. \n",
    "# Концом последовательности является любое число НЕ ДЕЛЯЩЕЕСЯ на 7. \n",
    "# Напишите программу, которая выводит члены данной последовательности.\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подается последовательность чисел, каждое число на отдельной строке.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести члены данной последовательности.\n",
    "\n",
    "a = int(input())        # считываем первое число последовательности\n",
    "while a%7 == 0:\n",
    "    print(a)\n",
    "    a = int(input())\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_5\n",
    "\n",
    "# На вход программе подается последовательность целых чисел, каждое число на отдельной строке. \n",
    "# Концом последовательности является любое отрицательное число. \n",
    "# Напишите программу, которая выводит сумму всех членов данной последовательности.\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подается последовательность чисел, каждое число на отдельной строке.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести сумму членов данной последовательности.\n",
    "\n",
    "a = int(input())    # считываем первое входное число последовательности\n",
    "sum = 0             # сумма\n",
    "while a >= 0:\n",
    "    sum += a\n",
    "    a = int(input())\n",
    "print(sum)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Задача_6\n",
    "\n",
    "# На вход программе подается последовательность целых чисел от 1 до 5, характеризующее оценку ученика, каждое число на отдельной строке. \n",
    "# Концом последовательности является любое отрицательное число, либо число большее 5. \n",
    "# Напишите программу, которая выводит количество пятерок.\n",
    "\n",
    "# Формат входных данных\n",
    "# На вход программе подается последовательность чисел, каждое число на отдельной строке.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести количество пятерок.\n",
    "\n",
    "a = int(input())    # считываем первое число последовательности\n",
    "k = 0               # счетчик пятерок\n",
    "while a>0 and a<6:\n",
    "    if a==5:        # проверка и подсчет пятерок\n",
    "        k += 1\n",
    "    a = int(input())\n",
    "print(k)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n"
     ]
    }
   ],
   "source": [
    "# Задача_7\n",
    "\n",
    "# Ведьмаку заплатите чеканной монетой\n",
    "\n",
    "# Всем известно, что ведьмак способен одолеть любых чудовищ, однако его услуги обойдутся недешево, к тому же ведьмак не принимает купюры, он принимает только чеканные монеты.\n",
    "# В мире ведьмака существуют монеты с номиналами 1, 5, 10, 25.\n",
    "# Напишите программу, которая определяет какое минимальное количество чеканных монет нужно заплатить ведьмаку.\n",
    "\n",
    "# Формат входных данных \n",
    "# На вход программе подается одно натуральное число, цена за услугу ведьмака.\n",
    "\n",
    "# Формат выходных данных\n",
    "# Программа должна вывести минимально возможное количество чеканных монет для оплаты.\n",
    "\n",
    "a = int(input())        # стоимость услуги\n",
    "count = 0               # счетчик количества монет\n",
    "while a>=25:            # подсчет количества монет номиналом 25\n",
    "    count += 1\n",
    "    a = a - 25\n",
    "while 10<=a<25:         # подсчет количества монет номиналом 10\n",
    "    count += 1\n",
    "    a = a - 10\n",
    "while 5<=a<10:          # подсчет количества монет номиналом 5\n",
    "    count += 1\n",
    "    a = a - 5\n",
    "while 1<=a<5:           # подсчет количества монет номиналом 1\n",
    "    count += 1\n",
    "    a = a - 1\n",
    "print(count)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.11.0 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0 (main, Oct 24 2022, 18:26:48) [MSC v.1933 64 bit (AMD64)]"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "ddac41972b0c940883be4cef39408fe7bdd4a6baf6c20cac086328bb00100dca"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
